---
kind: property
id: P:Autodesk.Revit.DB.Revision.Description
source: html/1c847358-0542-0ed9-8749-249eeaa3b279.htm
---
# Autodesk.Revit.DB.Revision.Description Property

The description of this Revision.

## Syntax (C#)
```csharp
public string Description { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: This operation cannot be performed on Revisions that have already been issued.